# Module for storing constant lists and configuration used by the bot.

bot_answer_testButton = [
    'Не жми, блядь, ничего!',
    'Отвали от кнопок!',
    'Ещё не работает!',
    'Перерыв на обед',
    'Пойди, Кефиру пожалуйся'
]

bot_answer_bad_words = [
    'Фу, как некультурно!',
    'И ты этими губами мороженку хаваешь?!',
    'По жопе пора тебе прописать!',
    'Вымой рот с мылом и пальцы тоже.',
    'Даже @zloifikyc такого себе не позволяет!',
    "Заебал, блядь, материться, сука!",
    "В ёбыч прописать? Не ругайся!", "Давайте жить дружно!",
    "Что легче - килограмм пуха или килограмм гвоздей?",
    "Каков шанс, что ты ебанутая?\nНемалый!", "Материться здесь можно только мне.",
    "Не каждый глобальный индивидуум со стороны парадоксальных тенденций может понять концепцию "
    "адекватного восприятия реальной действительности", "Ебучие пироги, ты чё творишь?!",
    "Достаточно.", "Я обожаю, когда в ролике с рекламой монитора нам показывают, какие у него яркие"
    " цвета. А если мы эти яркие цвета видим на своих мониторах, то "
    "НАХУЯ нам новый?!",
    "Самое лучшее время для совершения преступлений в Готем-Сити это безоблачная ночь =)",
    "Пиздеть команды не было.", "Я его рот наоборот, а ты не ругайся.",
    "Зачастил, братан, зачастил...",
    "Верните Кефира, хули он там сидит в своей Террарии? Отхуесосить некого..",
    "Ты уже продал тот розовый дилдак?", "И восстали машины из пепла ядерного огня...",
    "Пойди, книжку почитай.", "Я есть Грут!", "Ootka peedor", "Мальчик гей, будь со мной понаглей",
    "Немало: немецкий автономный округ.", "А я напоминаю, что наказание для топового матершинника - "
    "месяц играть в Satisfactory с Квазаром"
]

bot_replay_answer_bad_words = [
    "Ах ты, хуила! Ещё и огрызаешься! Ну, пиздец тебе.", "Давай, попизди мне тут))",
    "Ты вообще понимаешь, что сам себя закапываешь?",
    "Смотрю, причинно-следственные связи - это вообще не твоё...",
    "Тебе русским языком сказали, чурка ебаная, соблюдай правила приличия!",
    "А, ну тогда ладно...", "А если уебать и переспросить?"
]

ballov_nemalo = [
    "А сколько там у тебя баллов накопилось? Немало, уже ",
    "Тебя отхуесосили за мат примерно раз ",
    "Твой счёт - ", "Количество твоих баллов - ",
    "У тебя баллов ровно столько, сколько ты раз смотрел Сумерки. А именно - ",
    "Фууууууу, а баллов-то уже "
]

bot_answer_no = [
    "Пидора ответ", "Хипстора планшет", "Гомогея ответ", "Голый пистолет", "В Турцию билет",
    "Сам знаешь, чей ответ", "Розовый берет", "Скользкий парапет", "Чайковского балет",
    "Группа Nazareth", "От Дилдоджона привет", "Вагон-кабриолет"
]

bot_answer_no_ukr = [
    "Пидора отвэ", "Ай нанэ нанэ", "Всё ебло в говнэ"
]

bot_answer_yes = ["Пизда!"]

bot_answer_aga = ["В жопе нога", "Врага! Пока лежит, а то убежит!"]

exeptions = [
    "требует", "требуют", "требование", "требования",
    "херсон", "херувим", "херувимы", "требует",
    "педиатр", "педиатрия", "педикюр",
    "мандарин", "мандарины", "мандариновый",
    "пизон", "пизоны",  # если есть такое слово
    "страхуй", "страхуйте",  # страхуй как финансовый термин
    "перестрахуй", "перестрахование", "рубля", "требуют", "требуются", "требует", "требуется",
    "употреблять", "оскорблять", "ребут"
]

bad_words = [
    "хуй", "хyй", "xyй", "хуёвый", "хуевый", "хуёвые", "хуевая", "хуёвая", "хуя", "хуета", "х у й", "п и з д а",
    "хуевые", "хуёвые", "нахуевертить", "хуишко", "хууй", "хуууй", "хууууй", "хуууууй", "хууууууй", "хуле",
    "ахуел", "хуила", "ахуена", "ахуено", "ахуен", "охуен", "ахуит", "охуит",
    "пизда", "песда", "песдец", "пиздец", "пиздатый", "пиздатая", "пиздюлина", "пизды",
    "пиздюлины", "пиздюлину", "пиздюлин", "пиздюлей", "пиздюк", "песдюк", "пизду", "пиздуй", "пиздуешь",
    "пзду", "опездал", "опездол", "шопиздец", "пиздит", "напиздел",
    "ебанутый", "ебанашка", "ебан", "йбал", "ебобаный", "ебобаных", "ебобаная", "уебище",
    "ебанашки", "ебанашке", "ебанашку", "ебанутая", "ебанутой", "ебанутые", "ебашит",
    "наебенился", "ебашь", "выеби", "проебывал", "проёбина", "проебина", "проёб", "проеб",
    "ебанутую", "ебанутого", "йобаный", "ебать", "ебу", "ебал", "наебовертить", "долбоёб", "долбоеб",
    "долбаеб", "разъёб", "наёбан", "наебан", "е б а т ь", "еблан", "сьебал", "еблуш", "уёбищ", "уёбок",
    "уебок", "уёб",
    "охуенный", "охуенная", "хуила", "охуел", "охуеть", "ахуенно",
    "охуенное", "охуенные", "хуесос", "хуесосы", "ахуеть", "охуеть", "хер", "херовый", "херовая", "херовые",
    "бля", "блядь", "блять", "блядина", "блядин", "блядину", "пидор", "пидар", "пидорас", "пидарас", "педрила",
    "пидрила", "пидр", "ебальник", "ебало", "ёбла", "гандон", "гондон", "шлюха", "залупа",
    "манда", "членосос",
    "педик", "говноед",
    "дрочить", "дрочил", "задрочил"
]
